tutorials/immersedBoundary/pitzDailyLaminar/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    pitzDailyIB
    {
        type mixedIb;
        patchType immersedBoundary;
        triValue uniform (0 0 0);
        triGradient uniform (0 0 0);
        triValueFraction uniform 1;
        setDeadValue yes;
        deadValue (0 0 0);
        value uniform (0 0 0);
    }
    inlet
    {
        type fixedValue;
        value uniform (10 0 0);

    }
    outlet
    {
        type inletOutlet;
        inletValue uniform (0 0 0);
        value uniform (10 0 0);
    }
    top
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    bottom
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    frontAndBack
    {
        type empty;
    }
}

// ************************************************************************* //
